#ifndef BADAPPLEPLAYER_H
#define BADAPPLEPLAYER_H

#include "myhader.h"
#include "menu.h"
#include "button.h"
#include "kanamap.h"

struct LyricLine {
    int frameIndex;             // 起始帧号
    const char* text_line1;     // 歌词文本
    const char* text_line2;     // 歌词文本
};

// 可根据实际歌词与视频节奏手动调整 frameIndex
const LyricLine lyrics[] = {
    {0,     "Bad Apple!!",          "in 1602A"},
    {60,    "Code by",              "Kulib"},
    {120,   "Vocals:",              "nomico"},
    {180,   "Lyrics:",              "Haruka"},
    {240,   "Composition",          "ZUN"},
    {300,   " ",                    " "},
    {885,   "ながれてく",           "ときのなかででも"},
    {992,   "けだるさがほら",       "グルグルまわって"},
    {1095,  "わたしからはなれる",   "こころもみえないわ"},
    {1235,  "そう",                 "しらない？"},
    {1303,  "じぶんから",           "うごくこともなく"},
    {1407,  "ときのすきまに",       "ながされつづけて"},
    {1513,  "しらないわ",           "まわりのことなど"},
    {1616,  "わたしはわたし",       "それだけ"},
    {1720,  "ゆめみてる？",         "なにもみてない？"},
    {1809,  "かたるもむだな",       "じぶんのことば？"},
    {1914,  "かなしむなんて",       "つかれるだけよ"},
    {2019,  "なにもかんじず",       "すごせばいいの"},
    {2125,  "とまどうことば",       "あたえられても"},
    {2227,  "じぶんのこころ",       "ただうわのそら"},
    {2330,  "もしわたしから",       "うごくのならば"},
    {2439,  "すべてかえるの",       "ならくろにする"},
    {2542,  "こんなじぶんに",       "みらいはあるの？"},
    {2644,  "こんなせかいに",       "わたしはいるの？"},
    {2751,  "いませつないの？",     "いまかなしいの？"},
    {2855,  "じぶんのことも",       "わからないまま"},
    {2958,  "あゆむことさえ",       "つかれるだけよ"},
    {3063,  "ひとのことなど",       "しりもしないわ"},
    {3168,  "こんなわたしも",       "かわれるのなら"},
    {3273,  "もしかわれるの",       "ならしろになる？"},
    {3473,  " ",                    " "},
    {3808,  "ながれてく",           "ときのなかででも"},
    {3914,  "けだるさがほら",       "グルグルまわって"},
    {4017,  "わたしからはなれる",   "こころもみえないわ"},
    {4156,  "そう",                 "しらない？"},
    {4225,  "じぶんから",           "うごくこともなく"},
    {4329,  "ときのすきまに",       "ながされつづけて"},
    {4435,  "しらないわ",           "まわりのことなど"},
    {4537,  "わたしはわたし",       "それだけ"},
    {4641,  "ゆめみてる？",         "なにもみてない？"},
    {4732,  "かたるもむだな",       "じぶんのことば？"},
    {4839,  "かなしむなんて",       "つかれるだけよ"},
    {4940,  "なにもかんじず",       "すごせばいいの"},
    {5046,  "とまどうことば",       "あたえられても"},
    {5149,  "じぶんのこころ",       "ただうわのそら"},
    {5252,  "もしわたしから",       "うごくのならば"},
    {5360,  "すべてかえるの",       "ならくろにする"},
    {5465,  "うごくのならば",       "うごくのならば"},
    {5567,  "すべてこわすわ",       "すべてこわすわ"},
    {5672,  "かなしむならば",       "かなしむならば"},
    {5776,  "わたしのこころ",       "しろくかわれる？"},
    {5879,  "わなたのことも",       "わたしのことも"},
    {5983,  "すべてのことも",       "まだしらないの"},
    {6089,  "おもいまぶたを",       "あけたのならば"},
    {6192,  "すべてこわすの",       "ならくろになれ"},
};

const int lyricCount = sizeof(lyrics) / sizeof(lyrics[0]);

void playBadAppleFromFileRaw(const char* path);


#endif